src/config/InformationRegisters/Аналоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>Аналоги</Name>
			<Comment>Содержит аналоги номенклатуры и правила пересчета</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулСокр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заменяемое</Name>
					<Comment>Номенклатурная которую заменять</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заменитель</Name>
					<Comment>Номенклатурная на которую заменять</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/Аналоги/Ext/RecordSetModule.bsl
Перем Заменитель Экспорт;
Перем Заменяемое Экспорт;
Перем Коэффициент Экспорт;
Перем Обратимость Экспорт;
Перем Приоритет Экспорт;

Процедура ПередЗаписью(Отказ, Замещение)
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		//проверим заполнение
		Заменяемое = ЗаписьНабора.Заменяемое;	
		Заменитель = ЗаписьНабора.Заменитель;	
		Если (Заменитель = Заменяемое) И ((Не ЗначениеНеЗаполнено(Заменитель)) ИЛИ (Не ЗначениеНеЗаполнено(Заменяемое))) Тогда
			Сообщить("Заменитель не может быть равен заменяемому!",статусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		//Коэффициент = ЗаписьНабора.Коэффициент;	
		//Если (Коэффициент = 0) И ((Не ЗначениеНеЗаполнено(Заменитель)) ИЛИ (Не ЗначениеНеЗаполнено(Заменяемое))) Тогда
		//	Сообщить("Не указан коэффициент замены!",статусСообщения.Важное);
		//	Отказ = Истина;
		//	Возврат;
		//КонецЕсли;
		Если ТипЗнч(Заменяемое)=Тип("Строка") Тогда
		ЗаписьНабора.АртикулСокр=ПолучитьАртикулБезЗнаковПрепинания(Заменяемое) ;	
		ИначеЕсли ТипЗнч(Заменитель)=Тип("Строка") Тогда 
		ЗаписьНабора.АртикулСокр=ПолучитьАртикулБезЗнаковПрепинания(Заменитель) ;		
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение) 
КонецПроцедуры

Функция ПовыситьПриоритет() Экспорт
	// сначала выясним значение первого большего приоритета
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Аналоги.Заменяемое,
	|	Аналоги.Заменитель,
	|	Аналоги.Коэффициент,
	|	Аналоги.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.Аналоги КАК Аналоги
	|ГДЕ
	|	Аналоги.Заменяемое = &Заменяемое
	|	И Аналоги.Приоритет < &Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Заменяемое",Заменяемое);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПервыйПриоритет = Выборка.Приоритет;
	Иначе
		// повышаем приоритет текущего
		ПервыйПриоритет = Мин(0,Приоритет-1);
		НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
		НоваяЗапись.Заменяемое = Заменяемое;
		НоваяЗапись.Заменитель = Заменитель;
		НоваяЗапись.Коэффициент = Коэффициент;
		НоваяЗапись.Обратимость = Обратимость;
		НоваяЗапись.Приоритет = ПервыйПриоритет;
		НоваяЗапись.Записать();
		Возврат Истина;
	КонецЕсли;
	
	// теперь выберем все элементы с найденным значением
	Текст = "ВЫБРАТЬ
	|	Аналоги.Заменяемое,
	|	Аналоги.Заменитель,
	|	Аналоги.Коэффициент,
	|	Аналоги.Обратимость,
	|	Аналоги.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.Аналоги КАК Аналоги
	|ГДЕ
	|	Аналоги.Заменяемое = &Заменяемое
	|	И Аналоги.Приоритет = &Приоритет
	|";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Заменяемое",Заменяемое);
	Запрос.УстановитьПараметр("Приоритет",ПервыйПриоритет);
	
	
	// понижаем приоритет найденных
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
		НоваяЗапись.Заменяемое = Заменяемое;
		НоваяЗапись.Заменитель = Выборка.Заменитель;
		НоваяЗапись.Коэффициент = Выборка.Коэффициент;
		НоваяЗапись.Обратимость = Выборка.Обратимость;
		НоваяЗапись.Приоритет = ПервыйПриоритет+1;
		НоваяЗапись.Записать();
	КонецЦикла;	
	
	// повышаем приоритет текущего
	НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
	НоваяЗапись.Заменяемое = Заменяемое;
	НоваяЗапись.Заменитель = Заменитель;
	НоваяЗапись.Коэффициент = Коэффициент;
	НоваяЗапись.Обратимость = Обратимость;
	НоваяЗапись.Приоритет = ПервыйПриоритет;
	НоваяЗапись.Записать();
	
	Возврат Истина;
КонецФункции

Функция ПонизитьПриоритет() Экспорт
	
	// сначала выясним значение первого меньшего приоритета
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Аналоги.Заменяемое,
	|	Аналоги.Заменитель,
	|	Аналоги.Коэффициент,
	|	Аналоги.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.Аналоги КАК Аналоги
	|ГДЕ
	|	Аналоги.Заменяемое = &Заменяемое
	|	И Аналоги.Приоритет > &Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет ВОЗР";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Заменяемое",Заменяемое);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПервыйПриоритет = Выборка.Приоритет;
	Иначе
		// понижаем приоритет текущего
		ПервыйПриоритет = Приоритет+1;
		НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
		НоваяЗапись.Заменяемое = Заменяемое;
		НоваяЗапись.Заменитель = Заменитель;
		НоваяЗапись.Коэффициент = Коэффициент;
		НоваяЗапись.Обратимость = Обратимость;
		НоваяЗапись.Приоритет = ПервыйПриоритет;
		НоваяЗапись.Записать();
		Возврат Истина;
	КонецЕсли;
	
	// теперь выберем все элементы с найденным значением
	Текст = "ВЫБРАТЬ
	|	Аналоги.Заменяемое,
	|	Аналоги.Заменитель,
	|	Аналоги.Коэффициент,
	|	Аналоги.Обратимость,
	|	Аналоги.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.Аналоги КАК Аналоги
	|ГДЕ
	|	Аналоги.Заменяемое = &Заменяемое
	|	И Аналоги.Приоритет = &Приоритет
	|";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Заменяемое",Заменяемое);
	Запрос.УстановитьПараметр("Приоритет",ПервыйПриоритет);
	
	
	// понижаем приоритет найденных
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
		НоваяЗапись.Заменяемое = Заменяемое;
		НоваяЗапись.Заменитель = Выборка.Заменитель;
		НоваяЗапись.Коэффициент = Выборка.Коэффициент;
		НоваяЗапись.Обратимость = Выборка.Обратимость;
		НоваяЗапись.Приоритет = ПервыйПриоритет-1;
		НоваяЗапись.Записать();
	КонецЦикла;	
	
	// повышаем приоритет текущего
	НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
	НоваяЗапись.Заменяемое = Заменяемое;
	НоваяЗапись.Заменитель = Заменитель;
	НоваяЗапись.Коэффициент = Коэффициент;
	НоваяЗапись.Обратимость = Обратимость;
	НоваяЗапись.Приоритет = ПервыйПриоритет;
	НоваяЗапись.Записать();
	Возврат Истина;
КонецФункции	

Функция РасставитьПриоритетыУникально() Экспорт
	Текст = "ВЫБРАТЬ
	|	Аналоги.Заменяемое,
	|	Аналоги.Заменитель,
	|	Аналоги.Коэффициент,
	|	Аналоги.Обратимость,
	|	Аналоги.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.Аналоги КАК Аналоги
	|ГДЕ
	|	Аналоги.Заменяемое = &Заменяемое
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет ВОЗР";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Заменяемое",Заменяемое);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Приоритет=0;
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.Аналоги.СоздатьМенеджерЗаписи(); 
			НоваяЗапись.Заменяемое = Заменяемое;
			НоваяЗапись.Заменитель = Выборка.Заменитель;
			НоваяЗапись.Коэффициент = Выборка.Коэффициент;
			НоваяЗапись.Обратимость = Выборка.Обратимость;
			НоваяЗапись.Приоритет = Приоритет;
			НоваяЗапись.Записать();
			Приоритет = Приоритет+1;
		КонецЦикла;	
	КонецЕсли;
	КонецФункции
